#include <stdio.h>/*Βιβλιοθήκη που μου επιτρέπει να χρισημοποιώ printf/scanf*/

double add(double a, double b)/*Εδώ χρησιμοπο την double γιατί χρειαζόμαστε υψηλή ακρίβεια σε αριθμητικές πράξεις*/
{
    return a + b;/*εδώ λέω για το add θα πρέπει να προσθέση το ακέραιο α+β*/
}

double sub(double a, double b)/*Εδώ σρησιμοποίησα την double γιατί χρειαζόμαστε υψηλή ακρίβεια σε αριθμητικές πράξεις*/
{
    return a - b;/*Εδώ κάνω αφέρεση */
}

double mull(double a, double b)/*Εδώ σρησιμοποίησα την double γιατί χρειαζόμαστε υψηλή ακρίβεια σε αριθμητικές πράξεις*/
{
    return a * b; /*εδώ πολαπλασιασμό*/
}

double div(double a, double b)/*Εδώ σρησιμοποίησα την double γιατί χρειαζόμαστε υψηλή ακρίβεια σε αριθμητικές πράξεις*/
{
    if (b != 0) /*Εδώ δηλώνω ότι αν ο δεύτερος ακέραιος είναι διάφορο το 0 τότε να κάνει την διαίρεση*/
    {
        return a / b; /*Εδώ κάνει την διαίρεση*/
    }
    else/*Εδώ λέω ότι άν το b είναι 0 τότε να τυπώνει αυτό το μήνυμα*/
    {
        printf("Your result is Zerro, that's not acceptable.\nImbecile!\n");/*Το μήνυμα που βγάζει όταν το β=0 */
        
        return 0;
    }
}

int main()/*Το entry point της C η κύρια συνάρτηση*/
{
    double x, y, sum;/*Εδώ δηλώνω 3 μεταβλητές που θα τους βάλω αργότερα :)*/
    int telestis;/*Έναν τελεστή, γιατί τελεστη? πήρα την ιδέα από ψούνη για αυτό */

    printf("Insert the first number:  ");/*Εδώ ζητάω στον χρήστη να εισάγει έναν αριθμό*/
    scanf("%lf", &x);/*Εδώ ο χρήστης δηλώνει τον πρώτο αριθμό. Έβαλα lf γιατί το χ είναι double */

    printf("\nInsert the Second number:  ");/*Εδώ ζητάω στον χρήστη να εισάγει έναν αριθμό*/
    scanf("%lf", &y);/*Εδώ ο χρήστης δηλώνει τον πρώτο αριθμό. Έβαλα lf γιατί το y είναι double */

    printf("Select an operation \n1)+\n2)-\n3)*\n4)/\nYour input: ");/*Γράφω στον χρήστη να επιλέξει τι από τα 4 θέλει να κάνει*/
    scanf(" %d", &telestis);/*Εδω δηλώνει αν θέλει να κάνει πρόσθεση, αφαίρεση ,πολαπλασιασμό ή διαίρεση*/

    switch (telestis) /*Έβαλα τον τελεστή με switch έτσι ώστε να βάλω τους αριθμούς 1,2,3,4 σαν cases*/
    {
    case 1:/*Στο πρώτο case σύνδεσα τον αριθμό 1 για να κάνει την πρόσθεση*/
        sum = add(x, y); /*Εδώ έβαλα την συνάρτηση από πάνω για να κάνει την πρόσθεση δηλώνωντας το sum ως το άθροισμα*/
        printf("Result: %.2lf\n", sum);/*Εδω μου βγάζει το αποτέλεσμα της πρόσθεσης*/
        break;/*Το break σταματάει να συνεχιστεί η συνάρτηση*/
    case 2:/*Στο δευτερο case σύνδεσα τον αριθμό 2 για να κάνει την αφαίρεση*/
        sum = sub(x, y);/*Εδώ έβαλα την συνάρτηση από πάνω για να κάνει την αφαίρεση δηλώνωντας το sum ως το άθροισμα*/
        printf("Result: %.2lf\n", sum);/*Εδώ έβαλα την συνάρτηση από πάνω για να κάνει την αφαίρεση δηλώνωντας το sum ως το άθροισμα*/
        break;/*Το break σταματάει να συνεχιστεί η συνάρτηση*/
    case 3:
        sum = mull(x, y);/*Στο τρίτο case σύνδεσα τον αριθμό 3 για να κάνει τον πολαπλασιασμό*/
        printf("Result: %.2lf\n", sum);/*Εδώ έβαλα την συνάρτηση από πάνω για να κάνει τον πολαπλασιασμό δηλώνωντας το sum ως το γινόμενο*/
        break;/*Το break σταματάει να συνεχιστεί η συνάρτηση*/
    case 4:
        sum = div(x, y);/*Στο τέταρτο case σύνδεσα τον αριθμό 4 για να κάνει την διαίρεση*/
        printf("Result: %.2lf\n", sum);/*Εδώ έβαλα την συνάρτηση από πάνω για να κάνει την διαίρεση δηλώνωντας το sum ως το γινόμενο πηλίκο*/
        break;/*Το break σταματάει να συνεχιστεί η συνάρτηση*/
    default:/*Εδώ είναι όποτε το else του if αν τίποτα από τα πάνω δεν ισχύει να ξαναδοκιμάσει*/
        printf("Error, please try again.\n");/*Το μύνημα που εμφανίζει όταν ο χρήστης δεν έχει βάλει μία από τις 4 επιλογές*/
    }

    return 0;
}