#include <stdio.h>/*Βιβλιοθήκη που μου επιτρέπει να χρισημοποιώ printf/scanf*/
/*Καθολική συνάρτηση*/
void ElaxistMegisto(int min, int max);/*Μία void συνάρτηση για να την καλέσω αργότερα μέσα στην main για να κάνει τις πράξεις που θέλω*/

int main()/*Το entry point της C η κύρια συνάρτηση*/
{
    int a, b;/*Δήλωσα το α και β σαν 2 ακέραιες μεταβλητές*/
    do/*Αμυντικός μηχανισμός έτσι ώστε να είναι σίγουρο ότι ο πρώτος αριθμός θα είναι ο μικρότερος */
    {
        printf("Please insert the Lowest Number: ");/*Εδώ λέω στον χρήστη να Εισάγει τον μικρότερο αριθμό*/
        scanf("%d", &a);/*έδω γράφει ο χρήστης τον αριθμό*/
        printf("Please insert the Greatest Numver: ");/*Εδώ ζητάω από τον χρήστη να εισάγει τον μεγαλύτερο αριθμό*/
        scanf("%d", &b);/*εδώ γράφει ο χρήστης τον αριθμό*/

        if (a > b)/*εδώ έβαλά μία if έτσι ώστε όταν ο α είναι μεγαλύτερος από τον β να το ξανακάνει.*/
        {
            printf("\nThe Lower number surpass the Greater.\nPlease try again.\n\n");/*/ το μήνυμα που θα εμφανίσει στον χρήστη όταν ο α είναι μεγαλύτερος από το β*/
        }
    } while (a > b);/*Εδώ δηλώνω τι δεν πρέπει να ισχύει για να για να μπαίνει σε λειτουργία ο αμυντικός μηχανισμός και να κάνει τον χρήστη να επαναλβάνεται*/

    ElaxistMegisto(a,b);/*Εδώ καλώ την void συνάρτηση από κάτω για να κάνει τις πράξεις μέσα στην main */

    return 0;
}

void ElaxistMegisto(int min, int max)/* Δηλώνει μια συνάρτηση με όνομα ElaxistMegisto που δέχεται δύο ακέραιους, min και max, ως παραμέτρους */
{
    printf("\nThe even numbers between %d and %d are:\n ", min, max); /* Εκτυπώνει το μήνυμα με τις τιμές των min και max */
    for (int i = min; i <= max; i++)/* Αρχικοποιεί έναν βρόχο for με έναν ακέραιο i που ξεκινάει από min μέχρι max */
    {
        if (i % 2 == 0)/* Ελέγχει αν ο i είναι ζυγός αριθμός, επιβεβαιώνοντας αν το υπόλοιπο της διαίρεσης του με το 2 είναι μηδέν */
        {
            printf("%d, ", i);/* Εκτυπώνει τον ζυγό αριθμό ακολουθούμενο από κόμμα */
        }
    }
    printf("\n");/* Εκτυπώνει έναν χαρακτήρα νέας γραμμής */
}
    