#include <stdio.h> /*Εισαγωγή της βιβλιοθήκης stdio.h για είσοδο/έξοδο δεδομένων */

int plus(int p[], int value);/*Δήλωση της συνάρτησης για τον υπολογισμό του αθροίσματος*/
int small(int p[], int value);/*Δήλωση της συνάρτησης για την εύρεση του μικρότερου αριθμού*/
int big(int p[], int value);/*Δήλωση της συνάρτησης για την εύρεση του μεγαλύτερου αριθμού*/

int main()
{
    int p[10];/*Δήλωση πίνακα με 10 θέσεις*/
    int i;/*Δήλωση ακέραιου μεταβλητής i*/

    printf("Let's make an Array with 10 places\n\n");/*/Εκτύπωση μηνύματος για τη δημιουργία πίνακα*/

    do
    {
        for (i = 0; i < 10; i++)/*Βρόχος για εισαγωγή τιμών στον πίνακα*/
        {
            printf("Please insert the number in the %d box of the Array:", i + 1);/*Εκτύπωση μηνύματος για την εισαγωγή τιμής*/
            scanf("%d", &p[i]);/* Ανάγνωση τιμής από τον χρήστη και αποθήκευση στον πίνακα*/
        }
    } while (i < 0);/*Επανάληψη όσο υπάρχει αρνητικός αριθμός στον πίνακα*/
    {
        printf("There can't be a negative number in you Array");/*// Επανάληψη όσο υπάρχει αρνητικός αριθμός στον πίνακα*/
    }
    printf("\nYou have completed the Array.\n");/*Εκτύπωση μηνύματος ότι ο πίνακας ολοκληρώθηκε*/
    int sum = plus(p, 10);/*Κλήση της συνάρτησης plus και αποθήκευση του αθροίσματος*/
    printf("The sum of your numbers is %d\n", sum);/*Εκτύπωση του αθροίσματος*/
    int min = small(p, 10);/*Κλήση της συνάρτησης small και αποθήκευση του μικρότερου αριθμού*/
    printf("The minimu number is %d\n", min);/*min); // Εκτύπωση του μικρότερου αριθμού*/
    int max = big(p, 10);/*Κλήση της συνάρτησης big και αποθήκευση του μεγαλύτερου αριθμού*/
    printf("The biggest number is %d", max);/*Εκτύπωση του μεγαλύτερου αριθμού*/

    return 0;/*Επιστροφή 0 για την επιτυχή ολοκλήρωση του προγράμματος*/
}

int plus(int p[], int size)
{
    int sum = 0;/*Δήλωση και αρχικοποίηση της μεταβλητής sum*/
    for (int i = 0; i < size; i++)/* για την πρόσθεση των τιμών του πίνακα*/
    {
        sum = sum + p[i];/*Πρόσθεση για τις τιμες του πίνακα στο sum*/
    }
    return sum;/*Επιστροφή του αθροίσματος*/
}

int small(int p[], int size)/**/
{
    int min = p[0];/*]; // Δήλωση και αρχικοποίηση της μεταβλητής min με την πρώτη τιμή του πίνακα*/
    for (int i = 1; i < size; i++)/*για να βρει τον μικρότερο αριθμό*/
    {
        if (p[i] < min)/*ελέγχει αν ο αριθμός είναι μικρότερο από την min*/
        {
            min = p[i];/*αν ισχυεί τοτέ ενημερώνει τον αριθμό*/
        }
    }
    return min;/*επιστροή το μιν στην μαιν*/
}

int big(int p[], int size)
{
    int max = p[0];/*δηλώνει ΄την αρχικοποίηση της μεταβλητής μαχ*/
    for (int i = 1; i < size; i++)/*για να βρει τον μεγαλύτερο αριθμό*/
    {
        if (p[i] > max)/*ελέγχει αν ο αριθμός είναι μεγαλύτερος απο την μαξ*/
        {
            max = p[i];/*αν ισχυεί τοτέ ενημερώνει τον αριθμό*/
        }
    }
    return max;/*επιστροφή το μαξ στην μαιν*/
}