#include <stdio.h>/*Βιβλιοθήκη που μου επιτρέπει να χρισημοποιώ printf/scanf*/
#include <stdlib.h>/*Βιβλιοθήκη που μου βοηθάει στην διαχείριση μνήμης*/
#include <time.h>/*Βιβλιοθήκη που βοηθάει να παράγω έναν τυχαίο αριθμό */


void check(int guess, int number) /*βόιντ συνλαρτηση που βάζω 2 ακαίρεους, αυτόν που θα βάλω εγώ και αυτόν που σκέφτεται το πρόγραμμα*/
{
    if (guess > number) {/*Έβαλα την συνάρτηση if έτσι ώστε να του δώσω 3 περιπτώσεις. Η κάθε περίπτωη με το δικό της μήνυμα/αποτέλεσμα.Λέω έαν ο αριθμός που εισάγω είναι μικρότερος του αριθμού που σκέφτεται το πρόγραμμα*/
        printf("The number is smaller.\n");/*Τότε να μου εμφανίσει ότι ο αριθμός που σκέφτεται το πρόγραμμα είναι μικρότερος */
    } else if (guess < number) { /*και εδω γράφω για το αν ο αριθμός που εισάγουμε είναι μεγαλύτερος από αυτό που σκέφτεται το πρόγραμμα*/
        printf("The number is bigger.\n");/*και εδώ να εμφανίσει οτι ο αριθμός που σκέφτεται το πρόγραμμα είναι μεγαλύτερο. */
    } else {/*Εάν δεν είναι μικρότερο αλλά ούτε μεγαλύτερο τότε τον βρήκαμε*/
        printf("Chicken Winner takes the Dinner!!!.\n");/*Εδώ μας εμφανίζει το μήνυμα ότι ο χρήστης βρήκε τον αριθμό*/
    }
}

int main() { /*Το entry point της C η κύρια συνάρτηση*/
    int random, guess; /*Δηλώνω 2 ακέραιους αριθμούς, ο random του προγράμματος και ο guess αυτόν που θα εισάγουμε εμείς.*/

    srand(time(0)); /*Συνάρτηση που κάνει το πρόγραμμα να κρατήσει στην μνήμη του έναν αριθμό*/
    random = rand() % 100 + 1; /*Εδώ δηλώνουμε οτι ο αριθμός που μπορεί να κρατήση είναι ανάμεσα από το 1-100*/
    /*τους 2 πάνω κώδικες τους βρήκα στο ίντερνετ. Δεν τους σκέφτηκα μόνος μου.*/

    
    do { /*Εδώ έβαλα έναν αμυντικό μηχανισμό που να βάζει τον χρήστη να εισάγει έναν αριθμό μέχρι να βρεθεί αυτός που έχει αποθηκεύσει το πρόγραμμα.*/
        printf("Guess the number that I'm thinking, it's between 1-100: ");/*Μήνυμα που λέει στον χρήστη ότι πρέπει να μαντέψει ποιον αριθμό έχεο αποθηκεύση το πρόγραμμα*/
        scanf("%d", &guess); /*Εδώ ο χρήστης είσαγει τον ακέραιο αριθμό για να βρει αν είναι το ίδιο με αυτόν που έχει το πρόγραμμα*/
        check(guess, random);/*Εδώ έφερα την void συνάρτηση για να κάνει τις συναρτήσεις που έχω γράψει*/
    } while (guess != random);/*Εδώ έγραψα το όσο ο αριθμός που εισάγει ο χρήστης είναι διαφορετικός απο αυτόν του προγράμματος ξαναπάμε άπο την αρχή*/

    return 0;
}

/*Με δυσκόλεψε αρκετά η άσκηση και μου πείρε μία μέρα για να την λύσω, αλλά με την βοήθεια του ιντερνετ το βρήκα.*/